export default {
    "Q": {
        // チャージ中移動速度減少ペナルティ
        "movement_speed_penalty": 15,
        // 格闘アクション最小ダメージ
        "min_damage": {
            "base": [40, 60, 80, 100, 120],
            "amp": 70
        },
        // 格闘アクション最大ダメージ
        "max_damage": {
            "base": [80, 120, 160, 200, 240],
            "amp": 140
        },
        // 格闘アクション的中時クールダウン減少
        "cooldown_reduction": 55,
        // リバーブローダメージ
        "q2_damage": {
            "base": [30, 55, 80, 105, 130],
            "amp": 65
        },
        // リバーブロー的中対象1人あたり怒りゲージ獲得
        "rage": {
            "base": 100,
            "amp": 40
        },
        "cooldown": [14, 13, 12, 11, 10]
    },
    "W": {
        // カウンター持続時間
        "duration": 0.75,
        // カウンター中被ダメージ減少（％）
        "damage_reduction": [65, 70, 75, 80, 85],
        // カウンター成功時怒りのパンチ！実行可能時間
        "e2_duration": 7,
        "damage": {
            "base": [100, 125, 150, 175, 200],
            "amp": 70
        },
        // 移動速度減少
        "slow": {
            "duration": 2,
            "effect": 65
        },
        "cooldown": [8, 7.5, 7, 6.5, 6]
    },
    "E": {
        // 強力なパンチダメージ
        "damage": {
            "base": [60, 95, 130, 165, 200],
            "amp": 95
        },
        // 強力なパンチ的中時移動速度減少
        "slow": {
            "duration": 2,
            "effect": 40
        },
        // 怒りのパンチ！ダメージ
        "e2_damage": {
            "base": [70, 110, 150, 190, 230],
            "amp": 100
        },
        // 怒りのパンチ！的中時気絶時間
        "stun": 0.7,
        "cooldown": [12, 10.5, 9, 7.5, 6]
    },
    "R": {
        // 通常状態ダメージ
        "damage": {
            "base": [100, 180, 260],
            "amp": 35
        },
        // 短気状態ダメージ
        "enhanced_damage": {
            "base": [100, 200, 300],
            "amp": 100
        },
        // エアボーン時間
        "airborne": 1.1,
        "cooldown": [80, 70, 60]
    },
    "T": {
        // 怒りゲージ最大値（最大体力比％）
        "hp_conversion": 20,
        // 短気状態持続時間
        "enraged_duration": 5,
        // 短気状態攻撃速度増加（％）
        "attack_speed": [40, 45, 50],
        // 短気状態基本攻撃追加ダメージ
        "damage": {
            "base": [60, 85, 110],
            "amp": 35
        }
    }
}