export default {
    "common": {
        // 床に生成されるお魚の持続時間
        "fish": 10,
        // 床に生成されるお魚の最大数
        "fish_max": 2
    },
    "IremQ": {
        // 最小ダメージ
        "damage": {
            "base": [50, 70, 90, 110, 130],
            "amp": 55
        },
        // 床跳ね1回あたりの的中時ダメージ増加量（元ダメージ比）
        "ratio": 0.25,
        // 床跳ね回数
        "max_ratio_count": 3,
        "cooldown": [7, 6.5, 6, 5.5, 5]
    },
    "CatQ": {
        // 突進ダメージ
        "damage": {
            "base": [30, 60, 90, 120, 150],
            "amp": 65
        },
        // ネコの鈴対象的中時束縛時間
        "bind": 0.75,
        "rush": {
            // 連続攻撃ダメージ発生周期
            "tick": 0.1,
            // 連続攻撃回数
            "amount": 5
        },
        // 連続攻撃1回あたりダメージ
        "rush_damage": {
            "base": [6, 10, 14, 18, 22],
            "amp": 6
        },
        // 妨害効果対象的中時ダメージ増加量（元ダメージ比％）
        "additional_damage": 100,
        "cooldown": [5.5, 5, 4.5, 4, 3.5]
    },
    "IremW": {
        // 範囲内対象移動速度減少
        "slow": 30,
        // ダメージ発生までの時間
        "channel": 1,
        "damage": {
            "base": [40, 80, 120, 160, 200],
            "amp": 70
        },
        // 魅了時間
        "charm": [0.8, 0.9, 1, 1.1, 1.2],
        // 範囲内から離れた敵の移動速度減少効果持続時間
        "slow_remain": 1,
        "cooldown": [15, 14.5, 14, 13.5, 13]
    },
    "CatW": {
        "damage": {
            "base": [40, 80, 120, 160, 200],
            "amp": 80
        },
        // エアボーン時間
        "airborne": 0.8,
        // 的中時イレムE/猫Eクールダウン減少
        "cooldown_reduction": 1,
        "cooldown": 9
    },
    "IremE": {
        "cooldown": [17, 16, 15, 14, 13]
    },
    "CatE": {
        "damage": {
            "base": [40, 80, 120, 160, 200],
            "amp": 70
        },
        "cooldown": [11, 10, 9, 8, 7]
    },
    "IremR": {
        "damage": {
            "base": [10, 50, 90, 130],
            "amp": [25, 30, 35, 40]
        },
        // ネコの鈴持持続時間
        "bell": 4,
        // 基本攻撃射程ペナルティ
        "range_penalty": 1,
        "cooldown": {
            "constant": 1.5
        }
    },
    "CatR": {
        // お魚拾得時シールド
        "shield": {
            "base": [20, 45, 70, 95],
            "amp": 30
        },
        // お魚拾得時シールド持続時間
        "shield_duration": 2.5,
        "cooldown": {
            "constant": 1.5
        }
    },
    "T": {
        // 警戒中視界増加
        "vision": [0.75, 1, 1.25],
        // 警戒効果時間
        "stay": 15,
        // 慣れた地域でのイレム攻撃速度増加
        "attack_speed": [20, 30, 40],
        // 慣れた地域でのネコ防御力増加
        "defense": [8, 12, 16],
        // 魚系食べ物アイテムの消費時即時回復（元の総回復量あたり％）
        "fish_food": 10
    }
}