export default {
    "Q": {
        // セントリーガン最大体力
        "hp": {
            "base": 100,
            "level": 90
        },
        // セントリーガン持続時間
        "duration": 10,
        // セントリーガンの基本攻撃がレールガンに変更される周期
        "railgun_count": 4,
        // レールガン回数チャージ最大値
        "railgun_charge": 3,
        // セントリーガン与ダメージ時Wクールダウン減少
        "w_cooldown_reduction": 10,
        // セントリーガン通常弾丸ダメージ
        "damage": {
            "base": [30,40,50,60,70],
            "amp": 20
        },
        // セントリーガンレールガンダメージ
        "railgun_damage": {
            "base": [60,80,100,120,140],
            "amp": 35
        },
        // セントリーガン防御力
        "sentry_defence": 75,
        // セントリーガン攻撃速度
        "sentry_attack_speed": 1.5,
        "charge": {
            "max": 2,
            "time": [16,15,14,13,12]
        },
        // セントリーガン維持範囲（ｍ）
        "retrieve_range": 11,
        // 維持範囲外への移動またはバーバラ死亡後にセントリーガンが消滅するまでの時間
        "remain": 1.5
    },
    "W": {
        "damage": {
            "base": [90,125,160,195,230],
            "amp": 85
        },
        // 的中時自己移動速度増加量
        "movement_speed": {
            "duration": 2,
            "effect": 25
        },
        "cooldown": [8,7.5,7,6.5,6]
    },
    "E": {
        "damage": {
            "base": [80,110,140,170,200],
            "amp": 55
        },
        // 中央的中時気絶時間
        "stun": 0.6,
        "cooldown": [14,13,12,11,10]
    },
    "R": {
        // Rキャンセル時のRクールダウン
        "cancel_cooldown": 3, 
        "Q": {
            // 強化セントリーガン最大体力
            "hp": {
                "base": 500,
                "level": 150
            },
            // 強化セントリーガン持続時間
            "duration": 8,
            // 強化セントリーガン攻撃速度
            "attack_speed": 0.3,
            // 強化セントリーガンの基本攻撃がレールガンに変更される周期
            "railgun_count": 3,
            // 強化セントリーガン通常弾丸ダメージ
            "damage": {
                "base": [90,110,130],
                "amp": 25
            },
            // 強化セントリーガンレールガンダメージ
            "railgun_damage": {
                "base": [100,125,150],
                "amp": 50
            },
            // 強化セントリーガン防御力
            "sentry_defence": 130,
            // 強化セントリーガン維持範囲（ｍ）
            "retrieve_range": 11,
            // 維持範囲外への移動またはバーバラ死亡後に強化セントリーガンが消滅するまでの時間
            "remain": 1.5
        },
        "W": {
            "damage": {
                "base": [200,250,300],
                "amp": 85,
                "targetMaxHP": 20
            },
            // 的中時追加持続ダメージ持続時間
            "dot_duration": 4,
            // 的中時追加持続ダメージ総量
            "dot_damage": {
                "base": [100,150,200],
                "amp": 50
            },
            // 的中時自己移動速度増加量
            "movement_speed": {
                "duration": 2,
                "effect": 40
            }
        },
        "E": {
            "damage": {
                "base": [150,200,250],
                "amp": 60
            },
            // 中央的中時気絶時間
            "stun": 0.6,
            // 磁力暴風地帯ダメージ発生周期
            "dot_tick": 0.5,
            // 磁力暴風地帯持続時間
            "area_duration": 2.5,
            // 磁力暴風地帯1ティックあたりダメージ
            "dot_damage": {
                "base": [30,40,50],
                "amp": 15
            },
            // 磁力暴風地帯範囲内の移動速度低下（％）
            "slow": 50
        },
        "cooldown": [65,55,45]
    },
    "T": {
        // 装備製作時間現象（％）
        "making_time_reduction": 20,
        // 基本攻撃追加ダメージ発生効果中の攻撃速度増加（％）
        "attack_speed": 100,
        // 基本攻撃追加ダメージ
        "damage": {
            "base": [60,90,120],
            "amp": [35,45,55]
        },
        // 基本攻撃追加ダメージ発生周期
        "cooldown": {
            "constant": [9,7,5]
        }
    }
}