export default {
    "Q": {
        // 通貨ダメージ
        "first_damage": {
            "base": [40, 50, 60, 70, 80],
            "amp": 30
        },
        // 着弾ダメージ
        "second_damage": {
            "base": [80, 115, 150, 185, 220],
            "amp": 65
        },
        "hp_cost": 40,
        "cooldown": [8, 7, 6, 5, 4]
    },
    "W": {
        // 無敵時間
        "duration": 1.5,
        // 移動速度増加（％）
        "movement_speed": 15,
        "damage": {
            "base": [100, 135, 170, 205, 240],
            "amp": 70
        },
        "hp_cost": [50, 60, 70, 80, 90],
        "cooldown": [17, 16, 15, 14, 13]
    },
    "E": {
        // 自身に使用した場合のシールド
        "shield": {
            "base": [60, 105, 150, 195, 240],
            "amp": 20
        },
        // 自身に使用した場合のシールド持続時間
        "shield_duration": 2.5,
        // 敵に使用した場合のダメージ
        "damage": {
            "base": [110, 125, 140, 155, 170],
            "amp": 70
        },
        // 敵に使用した場合の気絶時間
        "stun": 0.6,
        // 自身に使用した場合のクールダウン減少
        "cooldown_reduction": 2,
        "cooldown": [11, 10.5, 10, 9.5, 9]
    },
    "R": {
        // キャスト時間
        "cast": 1,
        // キャスト後爆発までの時間
        "blast": 3,
        // 攻撃範囲
        "range": 20,
        "damage": {
            "base": [150, 200, 250],
            "amp": 95
        },
        // 自身の失った体力1%あたり追加ダメージ
        "lost_hp_conversion": [2, 2.5, 3],
        // 自身へのダメージに対する最低保証体力
        "min_hp": 100,
        // パッシブ効果強化持続時間
        "passive_enhance_duration": [6, 7, 8],
        // パッシブ効果威力増加（％）
        "passive_enhance": 100,
        // スキル非成立時のクールダウン返還（％）
        "cooldown_return": 50,
        "cooldown": [90, 80, 70]
    },
    "T": {
        // 失った体力比例体力回復（ツールチップ表示値）
        "heal": {
            "min": [2, 4, 6],
            "max": [10, 20, 30]
        },
        // 失った体力比例スキル増幅（ツールチップ表示値）
        "amp": {
            "min": [4, 7, 10],
            "max": [28, 39, 50]
        },
        // ウィルソン拾得後の基本攻撃追加ダメージ
        "damage": {
            "base": 30,
            "amp": 40,
            "level": 9
        },
        // ウィルソン拾得後の追加攻撃的中時移動速度減少
        "slow": {
            "duration": 2,
            "effect": [10, 20, 30]
        },
        "cooldown": {
            "constant": 2
        }
    }
}