export default {
    "Q": {
        // 磁力の手弾丸ダメージ
        "damage": {
            "base": [100,140,180,220,260],
            "amp": 40
        },
        // 磁力線対象を向いているときの移動速度増加量最小値（％）
        "movement_speed": 25,
        // 磁力線対象を向いているときの移動速度増加量最大値（％）
        "near_movement_speed": [25,27.5,30,32.5,35],
        // 磁力線対象基本攻撃時追加スキルダメージ
        "basic_attack_damage": {
            "level": 8,
            "targetMaxHP": [6,7,8,9,10]
        },
        // 磁力線対象基本攻撃時気絶時間
        "stun": 0.9,
        "cooldown": [7,6.5,6,5.5,5]
    },
    "W": {
        // 地場シールド持続時間
        "duration": 2.5,
        // 前方からの被ダメージ減少量（％）
        "damage_reduction": 70,
        // 波動発射回数
        "waves": 5,
        // 波動1回あたりのダメージ
        "damage": {
            "base": [30,35,40,45,50],
            "amp": 25,
            "additionalMaxHP": 10
        },
        // 再使用または持続時間終了時の波動ダメージ
        "final_damage": {
            "base": [80,120,160,200,240],
            "amp": 50,
            "additionalMaxHP": 20
        },
        "cooldown": [14,13.5,13,12.5,12]
    },
    "E": {
        "damage": {
            "base": [60,90,120,150,180],
            "defense": 20, 
            "maxHP": 7
        },
        // 束縛時間
        "bind": [0.8,0.9,1,1.1,1.2],
        "cooldown": [14,13,12,11,10]
    },
    "R": {
        // 発動時ダメージ
        "damage": {
            "base": [70,160,250],
            "amp": 50
        },
        // フィールド内持続ダメージ・自己回復周期
        "tick": 0.5,
        // フィールド持続時間
        "duration": 3,
        // 自己回復量
        "heal": {
            "base": 30,
            "maxHP": [3,4,5]
        },
        // フィールド内持続ダメージ
        "damage_on_time": {
            "base": [16,20,24],
            "amp": 15
        },
        // フィールド内から外へ向かう敵の移動速度減少量（％）
        "slow": 60,
        // 再使用または持続時間終了時ダメージ
        "final_damage": {
            // 最小ダメージ
            "min": {
                "base": [100,150,200],
                "amp": 50,
                "additionalMaxHP": 12
            },
            // 最大ダメージ（持続時間完遂時）
            "max": {
                "base": [200,300,400],
                "amp": 100,
                "additionalMaxHP": 24
            }
        },
        "cooldown": [80,70,60]
    },
    "T": {
        // 発動時移動不可効果免疫時間
        "immune": 0.1,
        // 再活性化に必要な被ダメージなし時間
        "cooldown": {
            "constant": [18,13,8]
        },
        // 移動不可効果を与えたときの対象1人あたり自己回復量
        "heal": {
            "base": [20,35,50],
            "maxHP": [2,3,4]
        }
    }
}