export default {
    "Q": {
        // スポットライト発動回数
        "count": 3,
        // スポットライト1回あたりダメージ
        "damage": {
            "base": [70, 80, 90, 100, 110],
            "amp": 40
        },
        // スポットライト的中時クールダウン減少
        "cooldown_reduction": 0.5,
        // スポットライト自身に当てたときのバフ持続時間
        "buff_duration": 6,
        // スポットライト自己バフ最大スタック数
        "max_stack": 3,
        // 赤ワイン時のスポットライト自己バフ攻撃速度増加（％）
        "red_attack_speed": 3,
        // ブラックティー時のスポットライト自己バフ移動速度増加（％）
        "black_movement_speed": 2,
        "cooldown": [9, 8.5, 8, 7.5, 7]
    },
    "W": {
        // カーペット設置時ダメージ
        "first_damage": {
            "base": [30, 55, 80, 105, 130],
            "amp": 40
        },
        // カーペット設置時移動速度減少
        "slow": {
            "duration": 0.25,
            "effect": 30
        },
        // 再発動時ダメージ
        "second_damage": {
            "base": [30, 55, 80, 105, 130],
            "amp": 40
        },
        "cooldown": 15
    },
    "E": {
        // 基本攻撃的中時クールダウン減少
        "cooldown_reduction": 1,
        // 強化基本攻撃発生周期
        "count": 3,
        // 強化基本攻撃追加ダメージ
        "damage": {
            "base": [60, 90, 120, 150, 180],
            "amp": 58
        },
        "cooldown": {
            "constant": [13, 12, 11, 10, 9]
        }
    },
    "R": {
        // 授賞式ステージ範囲内移動速度減少（％）
        "slow": [25, 30, 35],
        // 授賞式ステージ持続時間
        "duration": 2,
        // 授賞式ステージ消滅時ダメージ
        "damage": {
            "base": [150, 240, 330],
            "amp": 70
        },
        // 授賞式ステージ消滅時魅了時間
        "charm": 0.8,
        "cooldown": [80, 65, 50]
    },
    "T": {
        // ペルソナ切り替え時自己バフ持続時間
        "buff_duration": 6,
        // 赤ワイン切り替え時攻撃速度増加（％）
        "attack_speed": [30, 45, 60],
        // ブラックティー切り替え時移動速度増加（％）
        "movement_speed": 4,
        // 死の演技持続時間
        "act_duration": 3,
        // 死の演技からの復活時回復
        "hp": {
            "base": 100,
            "maxHP": [2, 11, 20]
        },
        // 死の演技クールダウン
        "cooldown": {
            "constant": 90
        }
    }
}