export default {
    "common": {
        // 固定攻撃速度
        "attackSpeed": 0.66
    },
    "Q": {
        "damage": {
            "base": [60, 100, 140, 180, 220],
            "amp": 80
        },
        "cooldown": [5, 4.5, 4, 3.5, 3]
    },
    "W": {
        // 持続中の1ティックあたりダメージ
        "damage": {
            "base": [40, 60, 80, 100, 120],
            "amp": 30
        },
        // 範囲内移動速度減少（％）
        "slow": 40,
        // 最終ダメージ
        "finish_damage": {
            "base": [50, 85, 120, 155, 190],
            "amp": 75
        },
        // 最終ティック的中時束縛時間
        "bind": 1.6,
        "cooldown": [14, 13, 12, 11, 10]
    },
    "E": {
        // フレーム的中うダメージ
        "first_damage": {
            "base": [30, 50, 70, 90, 110],
            "amp": 40
        },
        // フレーム的中時移動速度減少
        "slow": {
            "duration": 1,
            "effect": 55
        },
        // フレーム的中後の対象に引き寄せ基本攻撃が可能になる時間
        "pull": {
            "from": 1.5,
            "until": 3.5
        },
        // 引き寄せ基本攻撃追加ダメージ
        "second_damage": {
            "base": [30, 50, 70, 90, 110],
            "amp": 40
        },
        // フレーム的中後の対象への基本攻撃射程
        "pull_basic_attack_range": 10,
        // フレーム的中対象の刻印維持半径（ｍ）
        "mark_remain_range": 8,
        "cooldown": [12, 11.5, 11, 10.5, 10]
    },
    "R": {
        // 詠唱時間
        "cast": 1.35,
        // 行動不可時間
        "statis": 2.5,
        // 射程
        "range": [11, 12, 13],
        "cooldown": [80, 70, 60]
    },
    "T": {
        // 基本攻撃追加ダメージ
        "damage": {
            "base": [30, 60, 90],
            "attackSpeed": 20,
            "amp": 65
        },
        // 被写体スタック1あたりのスキル与ダメージ増幅量（％）
        "stack_damage_amp": [4, 7, 10],
        // 被写体スタック最大数
        "max_stack": 3
    }
}