export default {
    "Q": {
        "damage": {
            "base": [80, 115, 150, 185, 220],
            "amp": 80
        },
        "cooldown": [11, 10, 9, 8, 7]
    },
    "W": {
        // シールド持続時間
        "duration": 2.5,
        // 自身へのシールド量
        "shield": {
            "base": [80, 110, 140, 170, 200],
            "amp": 40
        },
        // 味方へのシールド量
        "ally_shield": {
            "base": [50, 75, 100, 125, 150],
            "amp": 20
        },
        "cooldown": [14, 13, 12, 11, 10]
    },
    "E": {
        "damage": {
            "base": [70, 105, 140, 175, 210],
            "amp": 80
        },
        // エアボーン時間
        "airborne": 0.7,
        "cooldown": [16, 15, 14, 13, 12]
    },
    "R": {
        // 波乗りダメージ
        "damage": {
            "base": [100, 150, 200],
            "amp": 75
        },
        // 壁ヒット時追加ダメージ
        "wall_damage": {
            "base": [100, 200, 300],
            "amp": 70
        },
        // 壁ヒット時エアボーン時間
        "airborne": 0.3,
        "cooldown": [80, 70, 60]
    },
    "T": {
        // 水上移動速度増加（％）
        "movement_speed": [16, 22, 28],
        // 水上攻撃速度増加（％）
        "attack_speed": [30, 35, 40],
        // 水上基本攻撃追加ダメージ
        "damage": {
            "base": [30, 50, 70],
            "amp": 30
        },
        "cooldown": {
            "constant": [8, 6, 4]
        }
    }
}