export default {
    "Q": {
        // 不浄な気的中1つあたりダメージ
        "damage": {
            "base": [60,90,120,150,180],
            "amp": 65
        },
        // 不浄な気2つ目以降の的中1つあたりダメージ
        "additional_damage": {
            "base": [10,20,30,40,50],
            "amp": 8
        },
        // 的中時自己回復時間
        "heal_duration": 2.5,
        // 不浄な気的中時1つあたり自己回復
        "heal": {
            "base": [10,13,16,19,22],
            "amp": 3
        },
        "cooldown": [8,7,6,5,4]
    },
    "W": {
        // 最小自己シールド
        "shield": {
            "base": [90,110,130,150,170],
            "amp": 50
        },
        // 自己シールド量追加量最大値（％）
        "max_shield": 50,
        // 自己シールド量追加量が最大値に達する自己体力しきい値
        "max_shield_hp": 40,
        // シールド持続時間
        "duration": 6,
        // 発動から再使用可能になるまでの最小時間（秒）
        "reuse": 1.5,
        // 再発動時ダメージ
        "damage": {
            "base": [40,70,100,130,160],
            "amp": 50,
            "targetMaxHP": [6,7,8,9,10]
        },
        "cooldown": [13,12.5,12,11.5,11]
    },
    "E": {
        // 執着の鎖的中時ダメージ
        "damage": {
            "base": [50,70,90,110,130],
            "amp": 40
        },
        // 執着の鎖的中後再発動までに必要な維持時間
        "duration": 2,
        // 執着の鎖再発動時ダメージ
        "second_damage": {
            "base": [40,70,100,130,160],
            "amp": 70
        },
        // 執着の鎖再発動時束縛時間
        "bind": [1.2,1.3,1.4,1.5,1.6],
        "cooldown": [15,14,13,12,11]
    },
    "R": {
        // 暴走中基本攻撃射程増加
        "range": 1,
        // 暴走中最大体力増加
        "maxHP": [150,225,300],
        // 暴走中1秒あたりゲージ消費
        "gauge_consumption": 20,
        // 暴走中範囲内1秒あたりダメージ
        "damage": {
            "base": [60,70,80],
            "amp": 25
        },
        // 暴走中範囲内の敵1人あたり体力回復
        "heal": {
            "base": [12,17,22],
            "amp": 4
        },
        // 暴走中範囲内の敵存在時ゲージ回復/秒
        "gauge_gain": 30,
        // 審判ダメージ
        "finish_damage": {
            "base": [70,110,150],
            "amp": 25
        },
        // 対象の烙印スタック1あたりダメージ増加（％）
        "additional_damage_per_stack": 20,
        // 野生動物対象時の回復量倍率（％）
        "animal_heal": 10,
        // 野生動物対象時のゲージ回復量倍率（％）
        "animal_gauge": 50,
        "gauge_consumption_acceleration": {
            // 暴走ゲージ減少量増加開始時間
            "after": 5,
            // 暴走ゲージ減少量増加量（％）
            "effect": 50
        },
        "cooldown": [60,55,50]
    },
    "T": {
        // 烙印1スタックあたり治癒効果減少（％）
        "healing_reduction": [5.5,6.5,7.5],
        // 烙印スタック持続時間
        "duration": 6,
        // 烙印スタック最大数
        "max_stack": 4,
        // 烙印スタック最大の対象へ向かう移動速度増加（％）
        "movement_speed": [6,9,12]
    }
}