export default {
    "Q": {
        // 基礎ダメージ
        "damage": {
            "base": [60, 95, 130, 165, 200],
            "amp": 70
        },
        // 強化時ダメージ
        "enhanced_damage": {
            "base": [100, 150, 200, 250, 300],
            "amp": 110
        },
        // 強化時束縛時間
        "bind": 1,
        // 基礎回復量
        "heal": {
            "base": [10, 20, 30, 40, 50],
            "amp": 10
        },
        // 強化時回復量
        "enhanced_heal": {
            "base": [25, 35, 45, 55, 65],
            "amp": 15
        },
        "cooldown": [12, 11, 10, 9, 8]
    },
    "W": {
        // 香炉持続時間
        "duration": 6,
        // 香炉範囲内の敵移動速度減少
        "slow": [20, 22.5, 25, 27.5, 30],
        // 香炉範囲内の味方の攻撃速度増加（％）
        "attack_speed": [30, 32.5, 35, 37.5, 40],
        // 香炉範囲内の味方の武器熟練度獲得量増加（％）
        "mastery_addition": 20,
        // 香炉バフの離れた後の持続時間
        "effect_remain": 3,
        "cooldown": 10
    },
    "E": {
        // 効果付与対象の移動速度増加
        "movement_speed": {
            "duration": 2,
            "effect": {
                "base": [6, 8, 10, 12, 14],
                "amp": 2
            }
        },
        // 効果終了時の爆発ダメージ
        "damage": {
            "base": [50, 80, 110, 140, 170],
            "amp": 50
        },
        // 効果終了時の強化爆発ダメージ
        "enhanced_damage": {
            "base": [80, 1115, 150, 185, 220],
            "amp": 65
        },
        // 効果中に香炉に触れた味方のシールド
        "shield_duration": 2.5,
        "shield": {
            "base": [50, 80, 110, 140, 170],
            "amp": 30
        },
        // 効果対象へ向かう際の移動速度増加
        "chase_movement_speed": {
            "base": [5, 8, 11, 14, 17],
            "amp": 2
        },
        "cooldown": [20, 18, 16, 14, 12]
    },
    "R": {
        // 発動時突き飛ばしダメージ
        "damage": {
            "base": [180, 240, 300],
            "amp": 70
        },
        // 発動時回復量
        "heal": {
            "base": [30, 70, 110],
            "targetLostHP": [4, 6, 8]
        },
        // 持続時間
        "duration": 4,
        // 発動中防御力増加
        "defense": [16, 22, 28],
        // 発動中秒間回復量
        "heal_per_sec": {
            "base": [24, 48, 72],
            "amp": 20
        },
        "cooldown": [90, 75, 60]
    },
    "T": {
        // 妨害耐性増加（％）
        "tenacity": [5, 15, 25],
        // 回復またはシールドを与えた味方の妨害耐性増加
        "tenacity_ally": {
            // 持続時間
            "duration": 2,
            // 妨害耐性増加効果量（％）
            "effect": [5, 10, 15]
        }
    }
}