export default {
    "Q": {
        "damage": {
            "base": [70,110,150,190,230],
            "amp": 80
        },
        "cooldown": [8,7,6,5,4]
    },
    "W": {
        // 召喚時ダメージ
        "damage": {
            "base": [60,80,100,120,140],
            "amp": 50
        },
        // 召喚的中時移動速度減少
        "slow": {
            "duration": 0.3,
            "effect": 50
        },
        // 消滅までの時間
        "duration": 1,
        // 消滅時ダメージ
        "vanish_damage": {
            "base": [50,80,110,140,170],
            "amp": 65
        },
        // 消滅的中時気絶時間
        "stun": 1,
        "cooldown": [13,12.5,12,11.5,11]
    },
    "E": {
        "damage": {
            "base": [80,110,140,170,200],
            "amp": 65
        },
        "cooldown": [14,13,12,11,10]
    },
    "R": {
        // 次の一般スキル強化効果持続時間
        "duration": 12,
        "Q": {
            // 法典上ダメージ（2発目）発生までの時間
            "second_time": 0.5,
            // 法典上ダメージ
            "damage": {
                "base": [160,240,320],
                "amp": 75
            },
            // Rクールダウン返却量（％）
            "cooldown_reduction": 60
        },
        "W": {
            // 障壁接触時束縛時間
            "bind": [0.9,1,1.1],
            // 障壁持続時間
            "duration": 5,
            // 領域内1発あたりダメージ
            "damage": {
                "base": [100,140,180],
                "amp": 40
            },
            // 領域内移動速度減少
            "slow": {
                "duration": 0.3,
                "effect": 50
            }   
        },
        "E": {
            // 使用距離増加
            "range": [4,4.5,5],
            // 次元の通路持続時間
            "duration": 5
        },
        "cooldown": [20,18,16]
    },
    "T": {
        // 考古学的分析発動に必要な古代の精髄必要スタック
        "max_stack": [5,4,3],
        // 考古学的分析発動時回復量
        "heal": {
            "base": [50,85,120],
            "amp": 10
        }
    }
}